var TC = {		
		tamilWeekDayNames: ["", "திங்கள்", "செவ்வாய்", "புதன் ", "வியாழன்", "வெள்ளி", "சனி ", "ஞாயிறு"],
		tamilYearName: new Array("","பிரபவ","விபவ","சுக்ல","பிரமோதூத","பிரசோற்பத்தி","ஆங்கீரச","ஸ்ரீமுக","பவ","யுவ","தாது","ஈஸ்வர","வெகுதானிய","பிரமாதி","விக்கிரம","விஷு","சித்திரபானு","சுபானு","தாரண","பார்த்திப","விய","சர்வசித்து","சர்வதாரி","விரோதி","விக்ருதி","கர","நந்தன","விஜய","ஜய","மன்மத","துன்முகி","ஹேவிளம்பி","விளம்பி","விகாரி","சார்வரி","பிலவ","சுபகிருது","சோபகிருது","குரோதி","விசுவாசுவ","பரபாவ","பிலவங்க","கீலக","சௌமிய","சாதாரண","விரோதகிருது","பரிதாபி","பிரமாதீச","ஆனந்த","ராட்சச","நள","பிங்கள","காளயுக்தி","சித்தார்த்தி","ரௌத்திரி","துன்மதி","துந்துபி","ருத்ரோத்காரி","ரக்தாட்சி","குரோதன","அட்சய"},
		tamilMonthName: new Array("","சித்திரை", "வைகாசி", "ஆனி", "ஆடி", "ஆவணி", "புரட்டாசி", "ஐப்பசி", "கார்த்திகை", "மார்கழி", "தை", "மாசி", "பங்குனி"),
		peruPoluthu: new Array("","இளவேனில்", "முதுவேனில்", "கார்", "கூதிர்", "முன்பனி", "பின்பனி"),
		siruPoluthu: new Array("","வைகறை", "காலை", "நண்பகல்", "எற்பாடு", "மாலை", "யாமம்"),
		get_tamil_season: function (ta_month) {
			if (ta_month <= 2)
				return 1;
			else if (ta_month <= 4)
				return 2;
			else if (ta_month <= 6)
				return 3;
			else if (ta_month <= 8)
				return 4;
			else if (ta_month <= 10)
				return 5;
			else if (ta_month <= 12)
				return 6;
		},
		get_tamil_day_poluthu: function (eng_time) {
			if (eng_time > 2 && eng_time <= 6)
				return 1;
			else if (eng_time > 6 && eng_time <= 10)
				return 2;
			else if (eng_time > 10 && eng_time <= 14)
				return 3;
			else if (eng_time > 14 && eng_time <= 18)
				return 4;
			else if (eng_time > 18 && eng_time <= 22)
				return 5;
			else if (eng_time > 22 && eng_time <= 2)
				return 6;
		},
	}